RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_rtc.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_rtc.c
 **
 ** A detailed description is available at
 ** @link RtcGroup Real-Time Clock description @endlink
 **
 **   - 2018-11-22  CDT  First version for Device Driver Library of RTC.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_rtc.h"
#include "hc32f460_utility.h"

#if (DDL_RTC_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup RtcGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for clock source type */
#define IS_VALID_CLK_SOURCE_TYPE(x)                                            \
(   (RtcClkXtal32 == (x))                       ||                             \
    (RtcClkLrc == (x)))

/*!< Parameter valid check for period interrupt condition */
#define IS_VALID_PERIOD_INT_CONDITION(x)                                       \
(   (RtcPeriodIntInvalid == (x))                ||                             \
    (RtcPeriodIntHalfSec == (x))                ||                             \
    (RtcPeriodIntOneSec == (x))                 ||                             \
    (RtcPeriodIntOneMin == (x))                 ||                             \
    (RtcPeriodIntOneHour == (x))                ||                             \
    (RtcPeriodIntOneDay == (x))                 ||                             \
    (RtcPeriodIntOneMon == (x)))

/*!< Parameter valid check for time format */
#define IS_VALID_TIME_FORMAT(x)                                                \
(   (RtcTimeFormat12Hour == (x))                ||                             \
    (RtcTimeFormat24Hour == (x)))

/*!< Parameter valid check for compensation way */
#define IS_VALID_COMPEN_WAY(x)                                                 \
(   (RtcOutputCompenDistributed == (x))         ||                             \
    (RtcOutputCompenUniform == (x)))

/*!< Parameter valid check for compensation value range */
#define IS_VALID_COMPEN_VALUE_RANGE(x)          ((x) <= 0x1FFu)

/*!< Parameter valid check for data format */
#define IS_VALID_DATA_FORMAT(x)                                                \
(   (RtcDataFormatDec == (x))                   ||                             \
    (RtcDataFormatBcd == (x)))

/*!< Parameter valid check for time second */
#define IS_VALID_TIME_SECOND(x)                 ((x) <= 59u)

/*!< Parameter valid check for time minute */
#define IS_VALID_TIME_MINUTE(x)                 ((x) <= 59u)

/*!< Parameter valid check for time hour */
#define IS_VALID_TIME_HOUR12(x)                 (((x) >= 1u) && ((x) <= 12u))
#define IS_VALID_TIME_HOUR24(x)                 ((x) <= 23u)

/*!< Parameter valid check for date weekday */
#define IS_VALID_DATE_WEEKDAY(x)                ((x) <= 6u)

/*!< Parameter valid check for date day */
#define IS_VALID_DATE_DAY(x)                    (((x) >= 1u) && ((x) <= 31u))

/*!< Parameter valid check for date month */
#define IS_VALID_DATE_MONTH(x)                  (((x) >= 1u) && ((x) <= 12u))

/*!< Parameter valid check for date year */
#define IS_VALID_DATE_YEAR(x)                   ((x) <= 99u)

/*!< Parameter valid check for hour12 am/pm */
#define IS_VALID_HOUR12_AMPM(x)                                                \
(   (RtcHour12Am == (x))                        ||                             \
    (RtcHour12Pm == (x)))

/*!< Parameter valid check for alarm weekday */
#define IS_VALID_ALARM_WEEKDAY(x)               (((x) >= 1u) && ((x) <= 0x7Fu))

/*!< Parameter valid check for interrupt request type */
#define IS_VALID_IRQ_TYPE(x)                                                   \
(   (RtcIrqPeriod == (x))                       ||                             \
    (RtcIrqAlarm == (x)))

/*!< 12 hour format am/pm status bit */
#define RTC_HOUR12_AMPM_MASK                    (0x20u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief De-Initialize RTC
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorTimeout                De-Initialize timeout
 **
 ******************************************************************************/
en_result_t RTC_DeInit(void)
{
    uint8_t u8RegSta;
    uint32_t u32Timeout, u32TimeCnt = 0u;
    en_result_t enRet = Ok;

    M4_RTC->CR0_f.RESET = 0u;
    /* Waiting for normal count status or end of RTC software reset */
    u32Timeout = SystemCoreClock >> 8u;
    do
    {
        u8RegSta = (uint8_t)M4_RTC->CR0_f.RESET;
        u32TimeCnt++;
    } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 1u));

