RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_rtc.c
        if (0u == u8RegSta)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            M4_RTC->CR2_f.RWREQ = 0u;
            /* Waiting for RTC RWEN bit reset */
            u32TimeCnt = 0u;
            do
            {
                u8RegSta = (uint8_t)M4_RTC->CR2_f.RWEN;
                u32TimeCnt++;
            } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 1u));

            if (1u == u8RegSta)
            {
                enRet = ErrorTimeout;
            }
            else
            {
                enRet = Ok;
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set RTC 1hz output compensation value
 **
 ** \param [in] u16CompenVal            Clock compensation value
 ** \arg 0~0x1FF
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_SetClkCompenValue(uint16_t u16CompenVal)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_COMPEN_VALUE_RANGE(u16CompenVal));

    M4_RTC->ERRCRH_f.COMP8 = ((uint32_t)u16CompenVal >> 8u) & 0x01u;
    M4_RTC->ERRCRL = (uint32_t)u16CompenVal & 0x00FFu;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable clock compensation
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable RTC clock compensation
 ** \arg Enable                         Enable RTC clock compensation
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_ClkCompenCmd(en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    M4_RTC->ERRCRH_f.COMPEN = enNewSta;

    return enRet;
}


/**
 *******************************************************************************
 ** \brief Enable or disable RTC 1hz output
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable RTC 1hz output
 ** \arg Enable                         Enable RTC 1hz output
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_OneHzOutputCmd(en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    M4_RTC->CR1_f.ONEHZOE = enNewSta;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set RTC current date and time
 **
 ** \param [in] enFormat                Date and time data format
 ** \arg RtcDataFormatDec               Decimal format
 ** \arg RtcDataFormatBcd               BCD format
 **
 ** \param [in] pstcRtcDateTime         Pointer to RTC date and time configuration
 ** \arg See the struct #stc_rtc_date_time_t
 **
 ** \param [in] enUpdateDateEn          The function new state(Contain year/month/day/weekday)
 ** \arg Disable                        Disable update RTC date
 ** \arg Enable                         Enable update RTC date
 **
 ** \param [in] enUpdateTimeEn          The function new state(Contain hour/minute/second)
 ** \arg Disable                        Disable update RTC time
 ** \arg Enable                         Enable update RTC time
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Enter or exit read/write mode failed
 ** \retval ErrorInvalidParameter       Parameter enUpdateDateEn or enUpdateTimeEn invalid
 **
 ******************************************************************************/
en_result_t RTC_SetDateTime(en_rtc_data_format_t enFormat, const stc_rtc_date_time_t *pstcRtcDateTime,
                            en_functional_state_t enUpdateDateEn, en_functional_state_t enUpdateTimeEn)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_DATA_FORMAT(enFormat));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enUpdateDateEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enUpdateTimeEn));

    /* Check update status */
    if (((Disable == enUpdateDateEn) && (Disable == enUpdateTimeEn)) || (NULL == pstcRtcDateTime))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check the date parameters */
        if (Enable == enUpdateDateEn)
        {
            if (RtcDataFormatDec == enFormat)
            {
                DDL_ASSERT(IS_VALID_DATE_YEAR(pstcRtcDateTime->u8Year));
                DDL_ASSERT(IS_VALID_DATE_MONTH(pstcRtcDateTime->u8Month));
                DDL_ASSERT(IS_VALID_DATE_DAY(pstcRtcDateTime->u8Day));
            }
            else
            {
                DDL_ASSERT(IS_VALID_DATE_YEAR(BCD2DEC(pstcRtcDateTime->u8Year)));
                DDL_ASSERT(IS_VALID_DATE_MONTH(BCD2DEC(pstcRtcDateTime->u8Month)));
                DDL_ASSERT(IS_VALID_DATE_DAY(BCD2DEC(pstcRtcDateTime->u8Day)));
            }
            DDL_ASSERT(IS_VALID_DATE_WEEKDAY(pstcRtcDateTime->u8Weekday));
        }
        /* Check the time parameters */
        if (Enable == enUpdateTimeEn)
        {
            if (RtcDataFormatDec == enFormat)
            {
                if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR12(pstcRtcDateTime->u8Hour));
                    DDL_ASSERT(IS_VALID_HOUR12_AMPM(pstcRtcDateTime->enAmPm));
                }
                else
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR24(pstcRtcDateTime->u8Hour));
                }
                DDL_ASSERT(IS_VALID_TIME_MINUTE(pstcRtcDateTime->u8Minute));
                DDL_ASSERT(IS_VALID_TIME_SECOND(pstcRtcDateTime->u8Second));
            }
            else
            {
                if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR12(BCD2DEC(pstcRtcDateTime->u8Hour)));
                    DDL_ASSERT(IS_VALID_HOUR12_AMPM(pstcRtcDateTime->enAmPm));
                }
                else
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR24(BCD2DEC(pstcRtcDateTime->u8Hour)));
                }
                DDL_ASSERT(IS_VALID_TIME_MINUTE(BCD2DEC(pstcRtcDateTime->u8Minute)));
                DDL_ASSERT(IS_VALID_TIME_SECOND(BCD2DEC(pstcRtcDateTime->u8Second)));
            }
        }

