RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_rtc.c
        /* Configure alarm registers */
        if (RtcDataFormatDec == enFormat)
        {
            if ((RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM) &&
                (RtcHour12Pm == pstcRtcAlarmTime->enAmPm))
            {
                M4_RTC->ALMHOUR = DEC2BCD((uint32_t)pstcRtcAlarmTime->u8Hour) | RTC_HOUR12_AMPM_MASK;
            }
            else
            {
                M4_RTC->ALMHOUR = DEC2BCD((uint32_t)pstcRtcAlarmTime->u8Hour);
            }
            M4_RTC->ALMMIN = DEC2BCD((uint32_t)pstcRtcAlarmTime->u8Minute);
        }
        else
        {
            if ((RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM) &&
                (RtcHour12Pm == pstcRtcAlarmTime->enAmPm))
            {
                M4_RTC->ALMHOUR = (uint32_t)pstcRtcAlarmTime->u8Hour | RTC_HOUR12_AMPM_MASK;
            }
            else
            {
                M4_RTC->ALMHOUR = (uint32_t)pstcRtcAlarmTime->u8Hour;
            }
            M4_RTC->ALMMIN = pstcRtcAlarmTime->u8Minute;
        }
        M4_RTC->ALMWEEK = pstcRtcAlarmTime->u8Weekday;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get RTC alarm time
 **
 ** \param [in] enFormat                Date and time data format
 ** \arg RtcDataFormatDec               Decimal format
 ** \arg RtcDataFormatBcd               BCD format
 **
 ** \param [out] pstcRtcAlarmTime       Pointer to RTC alarm time configuration
 ** \arg See the struct #stc_rtc_alarm_time_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Parameter error
 **
 ******************************************************************************/
en_result_t RTC_GetAlarmTime(en_rtc_data_format_t enFormat, stc_rtc_alarm_time_t *pstcRtcAlarmTime)
{
    en_result_t enRet = Ok;

    if(NULL == pstcRtcAlarmTime)
    {
        enRet = Error;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_DATA_FORMAT(enFormat));

        /* Get RTC date and time register */
        pstcRtcAlarmTime->u8Weekday = (uint8_t)M4_RTC->ALMWEEK;
        pstcRtcAlarmTime->u8Minute = (uint8_t)M4_RTC->ALMMIN;
        pstcRtcAlarmTime->u8Hour = (uint8_t)M4_RTC->ALMHOUR;
        if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
        {
            if ((pstcRtcAlarmTime->u8Hour & RTC_HOUR12_AMPM_MASK) == RTC_HOUR12_AMPM_MASK)
            {
                pstcRtcAlarmTime->u8Hour &= (uint8_t)(~RTC_HOUR12_AMPM_MASK);
                pstcRtcAlarmTime->enAmPm = RtcHour12Pm;
            }
            else
            {
                pstcRtcAlarmTime->enAmPm = RtcHour12Am;
            }
        }

        /* Check decimal format*/
        if (RtcDataFormatDec == enFormat)
        {
            pstcRtcAlarmTime->u8Hour = BCD2DEC(pstcRtcAlarmTime->u8Hour);
            pstcRtcAlarmTime->u8Minute = BCD2DEC(pstcRtcAlarmTime->u8Minute);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable RTC alarm function
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable RTC alarm function
 ** \arg Enable                         Enable RTC alarm function
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_AlarmCmd(en_functional_state_t enNewSta)
{
    uint8_t u8RtcSta;
    uint8_t u8IntSta;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    u8RtcSta = (uint8_t)M4_RTC->CR1_f.START;
    u8IntSta = (uint8_t)M4_RTC->CR2_f.ALMIE;
    /* Disable alarm interrupt and clear alarm flag when START=1 and ALMIE=1 */
    if ((1u == u8IntSta) && (1u == u8RtcSta))
    {
        M4_RTC->CR2_f.ALMIE = 0u;
    }
    M4_RTC->CR2_f.ALME = enNewSta;

    if ((1u == u8IntSta) && (1u == u8RtcSta))
    {
        M4_RTC->CR1_f.ALMFCLR = 0u;
        M4_RTC->CR2_f.ALMIE = u8IntSta;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable RTC interrupt request
 **
 ** \param [in] enIrq                   RTC interrupt request type
 ** \arg RtcIrqPeriod                   Period count interrupt request
 ** \arg RtcIrqAlarm                    Alarm interrupt request
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable interrupt request
 ** \arg Enable                         Enable interrupt request
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_IrqCmd(en_rtc_irq_type_t enIrq, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_IRQ_TYPE(enIrq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* enable/disable interrupt */
    switch (enIrq)
    {
        case RtcIrqPeriod:
            M4_RTC->CR2_f.PRDIE = enNewSta;
            break;
        case RtcIrqAlarm:
            M4_RTC->CR2_f.ALMIE = enNewSta;
            break;
        default:
            break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get RTC Alarm flag status
 **
 ** \param [in] None
 **
 ** \retval Set                         Flag is set
 ** \retval Reset                       Flag is reset
 **
 ******************************************************************************/
en_flag_status_t RTC_GetAlarmFlag(void)
{
    return (en_flag_status_t)(M4_RTC->CR2_f.ALMF);
}

/**
 *******************************************************************************
 ** \brief Clear RTC Alarm flag status
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_ClearAlarmFlag(void)
{
    en_result_t enRet = Ok;

    M4_RTC->CR1_f.ALMFCLR = 0u;

    return enRet;
}

//@} // RtcGroup

#endif /* DDL_RTC_ENABLE */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
